const CSVFormatter = function(csv) {
    csv = csv
        .match(/(.+(?=\#))|(^(?!\#).+)/mg)
        .map(line => {
            return line.split(',')
        })
        .map(infoElem => {
            infoObj = {}
            infoObj.x = infoElem[0] || ''
            infoObj.y = infoElem[1] || ''
            infoObj.name = infoElem[2] || ''
            infoObj.population = infoElem[3] || ''
            return infoObj
        })
        .sort((a, b) => b.population - a.population)
        .slice(0, 10)
        .reduce((prev, curr, i) => {
            prev[curr.name] = {
                population: curr.population,
                rating: ++i
            }
            return prev
        }, {})
    delete csv['']

    return (text) => {
        let cities = Object.keys(csv)

        cities.forEach(city => {
            let cityRegExp = new RegExp(city, 'gi')
            text = text.replace(cityRegExp, `${city} (${csv[city].rating} место в ТОП-10 самых крупных городов Украины, население ${csv[city].population} человек)`)
        })
        return text
    }
}

let csv = 
`
44.38,34.33,Алушта,31440,
49.46,30.17,Біла Церква,200131,
49.54,28.49,Бердичів,87575,#некоммент
#
46.49,36.58,#Бердянськ,121692,
#45.40,34.29,Джанкой,53624,
# в этом файле три строки-коммента :)
55.55,11.11,Кропивницький,300000
11.11,55.55,Львів,700000
55.55,11.11,Кропивницький,300000
34.12,51,23,Київ,3
51.12,55.28,Донецьк,3000000
61.05,46.12,Луганськ,2000000
50.23,51.18,Одеса,483009
11.11,11.11,Харків,2324243
55.55,55.55,Чернівці,365456
33.33,33.33,Черкаси,134234
`
const getCityInformation = CSVFormatter(csv)

console.log(getCityInformation(`Алушта файне місто, яке є Біла цеРкВа, що Бердичівбердичів біля  ріки Джанкой, топ місто Кропивницький та Львів`));
// Алушта файне місто, яке є Біла Церква (9 место в ТОП-10 самых крупных городов Украины, население 200131 человек), що Бердичівбердичів біля  ріки Джанкой, топ місто Кропивницький (8 место в ТОП-10 самых крупных городов Украины, население 300000 человек) та Львів (4 место в ТОП-10 самых крупных городов Украины, население 700000 человек)

console.log(getCityInformation(`
    Кропивницький 
    Львів
    Джанкой
    Біла Церква
    Донецьк
    Луганськ
    Алушта
    Одеса
    Харків
    Чернівці
    Черкаси
`))
//  Кропивницький (8 место в ТОП-10 самых крупных городов Украины, население 300000 человек)
//  Львів (4 место в ТОП-10 самых крупных городов Украины, население 700000 человек)
//  Джанкой
//  Біла Церква (9 место в ТОП-10 самых крупных городов Украины, население 200131 человек)
//  Донецьк (1 место в ТОП-10 самых крупных городов Украины, население 3000000 человек)
//  Луганськ (3 место в ТОП-10 самых крупных городов Украины, население 2000000 человек)
//  Алушта
//  Одеса (5 место в ТОП-10 самых крупных городов Украины, население 483009 человек)
//  Харків (2 место в ТОП-10 самых крупных городов Украины, население 2324243 человек)
//  Чернівці (6 место в ТОП-10 самых крупных городов Украины, население 365456 человек)
//  Черкаси (10 место в ТОП-10 самых крупных городов Украины, население 134234 человек)

// Алушта не топ 10, тому не виводиться
// Джанкой закоментована